In [9]:
# Always remember..

#iloc = indice (Similar to list iloc[0])
#loc = position (Similar to dictionary loc['SomeName'])

In [3]:
import pandas as pd

In [4]:
data = {
    'Name' : ['Johnny', 'Vincent', 'Sunny', 'Muhammad'],
    'LastName': ['Rodrigues', 'Boardman' , 'Bejugam', 'Mamoon' ],
    'Age' : [36,36,27,20]
}

In [6]:
df = pd.DataFrame(data)
df

       Name   LastName  Age
0    Johnny  Rodrigues   36
1   Vincent   Boardman   36
2     Sunny    Bejugam   27
3  Muhammad     Mamoon   20

In [7]:
df = pd.DataFrame(data)
df['LastName']

0    Rodrigues
1     Boardman
2      Bejugam
3       Mamoon
Name: LastName, dtype: object

In [8]:
df.iloc[0].loc['Name']

'Johnny'

In [10]:
df.columns

Index(['Name', 'LastName', 'Age'], dtype='object')

In [11]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      4 non-null      object
 1   LastName  4 non-null      object
 2   Age       4 non-null      int64
dtypes: int64(1), object(2)
memory usage: 228.0+ bytes

In [15]:
df.dtypes

Name        object
LastName    object
Age          int64
dtype: object

In [19]:
df['Weight'] = [30,40,65,14]
df.describe()
df

       Name   LastName  Age  Weight
0    Johnny  Rodrigues   36      30
1   Vincent   Boardman   36      40
2     Sunny    Bejugam   27      65
3  Muhammad     Mamoon   20      14

In [22]:
df.head()

       Name   LastName  Age  Weight
0    Johnny  Rodrigues   36      30
1   Vincent   Boardman   36      40
2     Sunny    Bejugam   27      65
3  Muhammad     Mamoon   20      14